# Key -> Data -> Split -> Apply -> Combine

In [18]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as pl
import seaborn as sns
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
'key2' : ['one', 'two', 'one', 'two', 'one'],
'data1' : np.random.randint(1,5,5),
'data2' : np.random.randint(1,5,5)})

In [20]:
df

  key1 key2  data1  data2
0    a  one      1      1
1    a  two      2      1
2    b  one      4      3
3    b  two      4      4
4    a  one      4      3

In [21]:
pd.crosstab(df['key1'],df['key2'])

key2  one  two
key1
a       2    1
b       1    1

In [22]:
grouped=df['data1'].groupby(df['key1'])
grouped

In [23]:
grouped.mean()

key1
a    2.333333
b    4.000000
Name: data1, dtype: float64

In [25]:
means=df['data1'].groupby([df['key1'],df['key2']]).sum()
means

key1  key2
a     one     5
      two     2
b     one     4
      two     4
Name: data1, dtype: int32

In [33]:
means.unstack()

key2  one  two
key1
a       5    2
b       4    4

In [40]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
grouped=df['data1'].groupby([states,years])
grouped.mean()

California  2005    2.0
            2006    4.0
Ohio        2005    2.5
            2006    4.0
Name: data1, dtype: float64

In [43]:
df.groupby(['key1','key2']).mean()

           data1  data2
key1 key2
a    one     2.5    2.0
     two     2.0    1.0
b    one     4.0    3.0
     two     4.0    4.0

In [44]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [52]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)
    print("\n")

a
  key1 key2  data1  data2
0    a  one      1      1
1    a  two      2      1
4    a  one      4      3


b
  key1 key2  data1  data2
2    b  one      4      3
3    b  two      4      4

In [50]:
for (k1,k2),group in df.groupby(['key1','key2']):
    print((k1,k2))
    print(group)

('a', 'one')
  key1 key2  data1  data2
0    a  one      1      1
4    a  one      4      3
('a', 'two')
  key1 key2  data1  data2
1    a  two      2      1
('b', 'one')
  key1 key2  data1  data2
2    b  one      4      3
('b', 'two')
  key1 key2  data1  data2
3    b  two      4      4

In [54]:
pieces=dict(list(df.groupby('key1')))
pieces

{'a':   key1 key2  data1  data2
 0    a  one      1      1
 1    a  two      2      1
 4    a  one      4      3,
 'b':   key1 key2  data1  data2
 2    b  one      4      3
 3    b  two      4      4}

In [59]:
list(df.groupby('key1'))

[('a',
    key1 key2  data1  data2
  0    a  one      1      1
  1    a  two      2      1
  4    a  one      4      3),
 ('b',
    key1 key2  data1  data2
  2    b  one      4      3
  3    b  two      4      4)]

In [64]:
pieces['b']

  key1 key2  data1  data2
2    b  one      4      3
3    b  two      4      4

In [65]:
pieces['a']

  key1 key2  data1  data2
0    a  one      1      1
1    a  two      2      1
4    a  one      4      3

In [68]:
df.dtypes

key1     object
key2     object
data1     int32
data2     int32
dtype: object

In [74]:
grouped=df.groupby(df.dtypes,axis=1)
list(grouped)

[(dtype('int32'),
     data1  data2
  0      1      1
  1      2      1
  2      4      3
  3      4      4
  4      4      3),
 (dtype('O'),
    key1 key2
  0    a  one
  1    a  two
  2    b  one
  3    b  two
  4    a  one)]

In [75]:
for dtype,group in grouped:
    print(dtype)
    print(group)

int32
   data1  data2
0      1      1
1      2      1
2      4      3
3      4      4
4      4      3
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [76]:
people = pd.DataFrame(np.random.randn(5, 5),
        columns=['a', 'b', 'c', 'd', 'e'],
        index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people

               a         b         c         d         e
Joe     0.191320 -0.645397  3.142692  0.756826 -0.360383
Steve  -1.574217  0.428932  0.117644 -1.693218  0.264885
Wes    -0.530470 -0.352791 -0.397809  1.783737  2.711920
Jim     0.659273 -0.134938  0.579734 -0.212421  0.048760
Travis -0.913590 -0.116712 -1.225935 -0.333282  0.526588

In [79]:
people.iloc[2:3,[1,2]]=np.nan

In [80]:
people

               a         b         c         d         e
Joe     0.191320 -0.645397  3.142692  0.756826 -0.360383
Steve  -1.574217  0.428932  0.117644 -1.693218  0.264885
Wes    -0.530470       NaN       NaN  1.783737  2.711920
Jim     0.659273 -0.134938  0.579734 -0.212421  0.048760
Travis -0.913590 -0.116712 -1.225935 -0.333282  0.526588

In [92]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
        'd': 'blue', 'e': 'red', 'e' : 'orange'}

In [93]:
by_column=people.groupby(mapping,axis=1)

In [94]:
by_column.sum()

            blue    orange       red
Joe     3.899518 -0.360383 -0.454077
Steve  -1.575574  0.264885 -1.145286
Wes     1.783737  2.711920 -0.530470
Jim     0.367313  0.048760  0.524335
Travis -1.559217  0.526588 -1.030303

In [95]:
map_series=pd.Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e    orange
dtype: object

In [101]:
people.groupby(map_series,axis=1).count(),

(        blue  orange  red
 Joe        2       1    2
 Steve      2       1    2
 Wes        1       1    1
 Jim        2       1    2
 Travis     2       1    2,)

In [99]:
people.groupby(len).sum()

          a         b         c         d         e
3  0.320122 -0.780335  3.722426  2.328142  2.400297
5 -1.574217  0.428932  0.117644 -1.693218  0.264885
6 -0.913590 -0.116712 -1.225935 -0.333282  0.526588

In [100]:
key_list = ['one', 'one', 'one', 'two', 'two']
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -0.530470 -0.645397  3.142692  0.756826 -0.360383
  two  0.659273 -0.134938  0.579734 -0.212421  0.048760
5 one -1.574217  0.428932  0.117644 -1.693218  0.264885
6 two -0.913590 -0.116712 -1.225935 -0.333282  0.526588

In [112]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
    [1, 3, 5, 1, 3]],
    names=['cty', 'tenor'])
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)
columns

MultiIndex([('US', 1),
            ('US', 3),
            ('US', 5),
            ('JP', 1),
            ('JP', 3)],
           names=['cty', 'tenor'])

In [113]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.109262  1.325485 -0.797187  1.215125  1.190244
1     -0.687994 -0.522538  0.105415 -1.058588 -1.534912
2      0.397834  0.099500  0.903303 -0.053766 -0.797687
3      1.047057 -1.518140 -0.587322  0.679406  0.394978

In [126]:
hier_df.groupby('cty',axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [167]:
grouped=df.groupby('key1')
list(grouped)

[('a',
    key1 key2  data1  data2
  0    a  one      1      1
  1    a  two      2      1
  4    a  one      4      3),
 ('b',
    key1 key2  data1  data2
  2    b  one      4      3
  3    b  two      4      4)]

In [169]:
pd.Series(grouped)

0    (a, [key1, key2, data1])
1           (b, [key1, key2])
dtype: object

In [144]:
grouped['data1'].quantile(0.9)

key1
a    3.6
b    4.0
Name: data1, dtype: float64

In [163]:
a=pd.Series(np.arange(0,12))
a

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
dtype: int32

In [164]:
a.quantile(0.5)

5.5

In [165]:
def peak_to_peak(arr):
    return arr.max()-arr.min()

In [166]:
grouped.agg(peak_to_peak)

      data1  data2
key1
a         3      2
b         0      1

In [170]:
grouped.describe()

     data1                                              data2            \
     count      mean       std  min  25%  50%  75%  max count      mean
key1
a      3.0  2.333333  1.527525  1.0  1.5  2.0  3.0  4.0   3.0  1.666667
b      2.0  4.000000  0.000000  4.0  4.0  4.0  4.0  4.0   2.0  3.500000


           std  min   25%  50%   75%  max
key1
a     1.154701  1.0  1.00  1.0  2.00  3.0
b     0.707107  3.0  3.25  3.5  3.75  4.0

In [174]:
tips=sns.load_dataset('tips')
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4